/* <- === === === === === === === === === === === === === === === === === === === ===  Навигатор.4.13  === === === === === === === === === === === === === === === === === === === === -> */
/* === Задача
Написать код, расчитывающий дистанцию о объекта:
 - addressLat - адрес назначения lat (например: 10)
	- addressLong - адрес назначение Long
	- positionlat - текущее положение пользователя lat
	- positionLong - текущее положение пользователя long
	В результате на основе этих координат нужно посчитать расстояние от текущего месторасположения до назначениея
=== */
// Code
function formLatLong() {
	let positionLat = 0,
		positionLong = 0,
		addressLat = Number(prompt('Введите широту', 0)),
		addressLong = Number(prompt('Введите долготу', 0)),
		dX = addressLat - positionLat,
		dY = addressLong - positionLong;
	return dX ** 2 + dY ** 2;
}
console.log(`Расстояния в квадратах: ${formLatLong()}`);

/* <- === === === === === === === === === === === === === === === === === === === ===  Навигатор.4.13 end  === === === === === === === === === === === === === === === === === === === === -> */
